{
  "version": 2.0,
  "lastUpdated": "Dezembro de 2025",
  "content": [
    {
      "type": "date",
      "text": "Última atualização: Dezembro de 2025"
    },
    {
      "type": "paragraph",
      "text": "O CamRB é um projeto independente de utilidade pública. Ao acessar, criar uma conta ou utilizar este serviço, você (\"Usuário\") concorda integralmente com os Termos de Uso e Política de Privacidade descritos abaixo."
    },
    {
      "type": "title",
      "text": "1. Natureza do Serviço e Fonte das Imagens"
    },
    {
      "type": "paragraph",
      "text": "O CamRB funciona exclusivamente como um AGREGADOR TECNOLÓGICO. Nós não possuímos, não operamos, não mantemos e não temos controle direto sobre nenhuma das câmeras exibidas."
    },
    {
      "type": "paragraph",
      "text": "Todas as imagens são de domínio público e são retransmitidas diretamente dos portais oficiais da Prefeitura de Rio Branco e órgãos competentes, incluindo, mas não se limitando a:"
    },
    {
      "type": "listItem",
      "text": "Portal De Olho no Trânsito (deolhonotransito.riobranco.ac.gov.br)"
    },
    {
      "type": "listItem",
      "text": "Portal De Olho no Rio (deolhonorio.riobranco.ac.gov.br)"
    },
    {
      "type": "listItem",
      "text": "Portal De Olho na Obra (deolhonaobra.riobranco.ac.gov.br)"
    },
    {
      "type": "paragraph",
      "text": "O CamRB atua apenas facilitando o acesso a essas informações que já são públicas, organizando-as em uma interface unificada."
    },
    {
      "type": "title",
      "text": "2. Isenção de Responsabilidade e Disponibilidade"
    },
    {
      "type": "paragraph",
      "text": "Como o CamRB apenas retransmite sinais de terceiros, não garantimos a disponibilidade contínua das imagens. Falhas de energia, manutenção técnica ou interrupções de internet na fonte original (Prefeitura) resultarão na indisponibilidade da câmera em nossa plataforma."
    },
    {
      "type": "paragraph",
      "text": "O desenvolvedor não se responsabiliza por:"
    },
    {
      "type": "listItem",
      "text": "Conteúdo visualizado nas transmissões;"
    },
    {
      "type": "listItem",
      "text": "Decisões tomadas com base nas imagens (ex: rotas de trânsito);"
    },
    {
      "type": "listItem",
      "text": "Interrupções no serviço causadas por terceiros."
    },
    {
      "type": "title",
      "text": "3. Uso Aceitável e Proibições"
    },
    {
      "type": "paragraph",
      "text": "O Usuário concorda em utilizar o serviço apenas para fins informativos pessoais. É estritamente proibido:"
    },
    {
      "type": "listItem",
      "text": "Utilizar as imagens para fins comerciais sem autorização;"
    },
    {
      "type": "listItem",
      "text": "Utilizar as imagens para perseguir, assediar ou monitorar ilegalmente indivíduos;"
    },
    {
      "type": "listItem",
      "text": "Tentar contornar as proteções de segurança do site;"
    },
    {
      "type": "listItem",
      "text": "Realizar engenharia reversa ou sobrecarregar nossos servidores (DDoS)."
    },
    {
      "type": "title",
      "text": "4. Privacidade e Dados (LGPD)"
    },
    {
      "type": "paragraph",
      "text": "Respeitamos sua privacidade e operamos em conformidade com as boas práticas de proteção de dados:"
    },
    {
      "type": "listItem",
      "boldPrefix": "Não Gravamos:",
      "text": "O CamRB não armazena histórico de vídeos ou imagens das câmeras. O serviço é estritamente 'ao vivo'."
    },
    {
      "type": "listItem",
      "boldPrefix": "Dados de Cadastro:",
      "text": "Se você criar uma conta, armazenamos apenas seu e-mail e nome para autenticação via Google Firebase. Não compartilhamos esses dados com terceiros."
    },
    {
      "type": "listItem",
      "boldPrefix": "Cookies e Analytics:",
      "text": "Utilizamos cookies básicos para lembrar suas preferências (como tema escuro) e Google Analytics para estatísticas anônimas de acesso."
    },
    {
      "type": "title",
      "text": "5. Contato e Suporte"
    },
    {
      "type": "paragraph",
      "text": "Para reportar falhas, solicitar a remoção de conteúdo, esclarecer dúvidas ou tratar de assuntos relacionados à LGPD, entre em contato exclusivamente pelo e-mail oficial:"
    },
    {
      "type": "paragraph",
      "boldPrefix": "E-mail:",
      "text": "suportecamrb@gmail.com"
    },
    {
      "type": "title",
      "text": "6. Alterações nos Termos"
    },
    {
      "type": "paragraph",
      "text": "Reservamo-nos o direito de atualizar estes termos a qualquer momento para refletir mudanças na legislação ou no serviço. O uso continuado da plataforma implica na aceitação dos novos termos."
    }
  ]
}